integration-test/src/test/resources/soap/send-message-to-recipient-2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ns1="urn:riv:itintegration:registry:1"
    xmlns:ns2="urn:riv:clinicalprocess:healthcond:certificate:3"
    xmlns:ns4="urn:riv:clinicalprocess:healthcond:certificate:types:3"
    xmlns:ns5="urn:riv:clinicalprocess:healthcond:certificate:SendMessageToRecipientResponder:2">
  <soapenv:Header>
    <ns1:LogicalAddress>FK</ns1:LogicalAddress>
  </soapenv:Header>
  <soapenv:Body>
    <ns5:SendMessageToRecipient>
      <ns5:meddelande-id>it-message-002</ns5:meddelande-id>
      <ns5:skickatTidpunkt>2024-11-10T08:00:00</ns5:skickatTidpunkt>
      <ns5:intygs-id>
        <ns4:root>TSTNMT2321000156-ALMC</ns4:root>
        <ns4:extension>it-send-message-cert-002</ns4:extension>
      </ns5:intygs-id>
      <ns5:patientPerson-id>
        <ns4:root>1.2.752.129.2.1.3.1</ns4:root>
        <ns4:extension>198202252386</ns4:extension>
      </ns5:patientPerson-id>
      <ns5:logiskAdressMottagare>FK</ns5:logiskAdressMottagare>
      <ns5:amne>
        <ns4:code>OVRIGT</ns4:code>
        <ns4:codeSystem>ffa59d8f-8d7e-46ae-ac9e-31804e8e8499</ns4:codeSystem>
        <ns4:displayName>Ovrigt</ns4:displayName>
      </ns5:amne>
      <ns5:rubrik>Test rubrik 2</ns5:rubrik>
      <ns5:meddelande>Integration test message 2</ns5:meddelande>
      <ns5:skickatAv>
        <ns2:personal-id>
          <ns4:root>1.2.752.129.2.1.4.1</ns4:root>
          <ns4:extension>TSTNMT2321000156-DRAA</ns4:extension>
        </ns2:personal-id>
        <ns2:fullstandigtNamn>Ajla Doktor</ns2:fullstandigtNamn>
        <ns2:forskrivarkod>0000000</ns2:forskrivarkod>
        <ns2:enhet>
          <ns2:enhets-id>
            <ns4:root>1.2.752.129.2.1.4.1</ns4:root>
            <ns4:extension>TSTNMT2321000156-ALMC</ns4:extension>
          </ns2:enhets-id>
          <ns2:arbetsplatskod>
            <ns4:root>1.2.752.29.4.71</ns4:root>
            <ns4:extension>1234567890</ns4:extension>
          </ns2:arbetsplatskod>
          <ns2:enhetsnamn>Alfa Medicincentrum</ns2:enhetsnamn>
          <ns2:postadress>Storgatan 1</ns2:postadress>
          <ns2:postnummer>12345</ns2:postnummer>
          <ns2:postort>Smamaala</ns2:postort>
          <ns2:telefonnummer>0101234567890</ns2:telefonnummer>
          <ns2:epost>AlfaMC@webcert.invalid.se</ns2:epost>
          <ns2:vardgivare>
            <ns2:vardgivare-id>
              <ns4:root>1.2.752.129.2.1.4.1</ns4:root>
              <ns4:extension>TSTNMT2321000156-ALFA</ns4:extension>
            </ns2:vardgivare-id>
            <ns2:vardgivarnamn>Alfa Regionen</ns2:vardgivarnamn>
          </ns2:vardgivare>
        </ns2:enhet>
      </ns5:skickatAv>
    </ns5:SendMessageToRecipient>
  </soapenv:Body>
</soapenv:Envelope>
